app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
  def index
    @trails = Trail.all

INSERT INTO "trails" ("name", "material", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Walnut Creek"], ["material", "Cement"], ["created_at", 2017-02-21 17:23:45 UTC], ["updated_at", 2017-02-21 17:23:45 UTC]]
---
  def create
    @trail = Trail.new(trail_params)

    respond_to do |format|
      if @trail.save

SELECT  "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_trail
      @trail = Trail.find(params[:id])